In [1]:
import pandas as pd
print(pd.__version__)

2.2.3

In [2]:
df = pd.read_excel('DataSet/team.xlsx')

In [5]:
df

        name team  Q1  Q2  Q3  Q4
0      Liver    E  89  21  24  64
1       Arry    C  36  37  37  57
2        Ack    A  57  60  18  84
3      Eorge    C  93  96  71  78
4        Oah    D  65  49  61  86
..       ...  ...  ..  ..  ..  ..
95   Gabriel    C  48  59  87  74
96   Austin7    C  21  31  30  43
97  Lincoln4    C  98  93   1  20
98       Eli    E  11  74  58  91
99       Ben    E  21  43  41  74

[100 rows x 6 columns]

In [7]:
df.head()

    name team  Q1  Q2  Q3  Q4
0  Liver    E  89  21  24  64
1   Arry    C  36  37  37  57
2    Ack    A  57  60  18  84
3  Eorge    C  93  96  71  78
4    Oah    D  65  49  61  86

In [5]:
df.tail()

        name team  Q1  Q2  Q3  Q4
95   Gabriel    C  48  59  87  74
96   Austin7    C  21  31  30  43
97  Lincoln4    C  98  93   1  20
98       Eli    E  11  74  58  91
99       Ben    E  21  43  41  74

In [8]:
df.sample(5)

       name team  Q1  Q2  Q3  Q4
96  Austin7    C  21  31  30  43
47    Jake3    C  69  23  11  40
12   Archie    C  83  89  59  68
3     Eorge    C  93  96  71  78
7      Lfie    A   9  10  99  37

In [9]:
df.shape

(100, 6)

In [10]:
df.describe()

               Q1          Q2          Q3          Q4
count  100.000000  100.000000  100.000000  100.000000
mean    49.200000   52.550000   52.670000   52.780000
std     29.962603   29.845181   26.543677   27.818524
min      1.000000    1.000000    1.000000    2.000000
25%     19.500000   26.750000   29.500000   29.500000
50%     51.500000   49.500000   55.000000   53.000000
75%     74.250000   77.750000   76.250000   75.250000
max     98.000000   99.000000   99.000000   99.000000

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    100 non-null    object
 1   team    100 non-null    object
 2   Q1      100 non-null    int64
 3   Q2      100 non-null    int64
 4   Q3      100 non-null    int64
 5   Q4      100 non-null    int64
dtypes: int64(4), object(2)
memory usage: 4.8+ KB

In [12]:
df.dtypes

name    object
team    object
Q1       int64
Q2       int64
Q3       int64
Q4       int64
dtype: object

In [13]:
df.axes

[RangeIndex(start=0, stop=100, step=1),
 Index(['name', 'team', 'Q1', 'Q2', 'Q3', 'Q4'], dtype='object')]

In [14]:
df.columns

Index(['name', 'team', 'Q1', 'Q2', 'Q3', 'Q4'], dtype='object')

In [16]:
df.set_index('name',inplace=True)

In [17]:
df['Q1']

name
Liver       89
Arry        36
Ack         57
Eorge       93
Oah         65
            ..
Gabriel     48
Austin7     21
Lincoln4    98
Eli         11
Ben         21
Name: Q1, Length: 100, dtype: int64

In [18]:
df.Q1

name
Liver       89
Arry        36
Ack         57
Eorge       93
Oah         65
            ..
Gabriel     48
Austin7     21
Lincoln4    98
Eli         11
Ben         21
Name: Q1, Length: 100, dtype: int64

In [19]:
df.loc[:,['team','Q1']]

         team  Q1
name
Liver       E  89
Arry        C  36
Ack         A  57
Eorge       C  93
Oah         D  65
...       ...  ..
Gabriel     C  48
Austin7     C  21
Lincoln4    C  98
Eli         E  11
Ben         E  21

[100 rows x 2 columns]

In [20]:
df[df.index=='Liver']

      team  Q1  Q2  Q3  Q4
name
Liver    E  89  21  24  64

In [21]:
df.loc['Ben','Q1':'Q4']

Q1    21
Q2    43
Q3    41
Q4    74
Name: Ben, dtype: object

In [22]:
df[(df['Q1']>90) & (df['team'] == 'C')]

          team  Q1  Q2  Q3  Q4
name
Eorge        C  93  96  71  78
Alexander    C  91  76  26  79
Lincoln4     C  98  93   1  20